[
  {
    "paperId": "b6b87f4a11ece51c932e36ea45b19fe3497b4929",
    "title": "Review of Battery Charger Topologies, Charging Power Levels, and Infrastructure for Plug-In Electric and Hybrid Vehicles",
    "authors": [
      {
        "authorId": "153396496",
        "name": "Mustafa YILMAZ"
      },
      {
        "authorId": "2608060",
        "name": "P. Krein"
      }
    ],
    "year": 2013,
    "citationCount": 2640,
    "openAccessPdf": {
      "url": "",
      "status": "CLOSED"
    },
    "hasOpenAccessPdf": true,
    "pdfUrl": ""
  },
  {
    "paperId": "ef9e7d7b5347597f855a71b8ba14671ac794be01",
    "title": "Public electric vehicle charger access disparities across race and income in California",
    "authors": [
      {
        "authorId": "2110550856",
        "name": "Chih-Wei Hsu"
      },
      {
        "authorId": "89985198",
        "name": "K. Fingerman"
      }
    ],
    "year": 2021,
    "citationCount": 190,
    "openAccessPdf": {
      "url": "https://doi.org/10.1016/j.tranpol.2020.10.003",
      "status": "HYBRID"
    },
    "hasOpenAccessPdf": true,
    "pdfUrl": "https://doi.org/10.1016/j.tranpol.2020.10.003"
  },
  {
    "paperId": "98d0799ab79427038f880e14599522bcc5c0cb70",
    "title": "A 300-kHz 6.6-kW SiC Bidirectional LLC Onboard Charger",
    "authors": [
      {
        "authorId": "2145539959",
        "name": "Haoran Li"
      },
      {
        "authorId": "122542913",
        "name": "Zhiliang Zhang"
      },
      {
        "authorId": "2151486308",
        "name": "Shengdong Wang"
      },
      {
        "authorId": "48252112",
        "name": "Jiacheng Tang"
      },
      {
        "authorId": "1954726",
        "name": "X. Ren"
      },
      {
        "authorId": "3191194",
        "name": "Qianhong Chen"
      }
    ],
    "year": 2020,
    "abstract": "The reverse LLC voltage gain is lower than unity. The dc-link voltage is then lower than the peak grid voltage so that the buck type dc–ac converters cannot be grid-tied directly, which causes the LLC reverse operation difficult in bidirectional application. This paper proposes a silicon carbide (SiC) bidirectional LLC charger architecture to achieve high efficiency and high power density. The first stage is an interleaved bridgeless totem pole power factor correction (PFC) to achieve unity power factor. The second stage is a 300-kHz LLC taking advantage of wide zero voltage switching (ZVS) range and magnetic integration. Thanks to extra control freedom of high dc-link voltage, the dc–dc voltage gain regulation is shared by the dc–ac stage taking advantage of high voltage SiC MOSFETs. A reverse LLC voltage gain compensation control by regulating dc-link voltage is proposed to enable the LLC bidirectional operation. A digital adaptive synchronous rectification driving scheme is proposed based on the LLC primary driver signals, which immunes to the circuit oscillation caused by high dv/dt and parasitic elements. A 6.6 kW SiC bidirectional LLC charger is build. The power density is 3.42 kW/L with 3 kW/kg and increases 55.6% over the reference design. The charging efficiency is above 96% through the battery voltage from 240 to 420 V, and 2% higher than the state-of-the-art products. The peak discharging efficiency under 6.6 kW is 96%, and 1% higher than the state-of-the-art efficiency.",
    "citationCount": 179,
    "openAccessPdf": {
      "url": ""
    },
    "hasOpenAccessPdf": true,
    "pdfUrl": ""
  }
]